"""

This package name is `whakerpy` which stands for "Web HTML maker in Python".

-----------------------------------------------------------------------------

 ██╗    ██╗ ██╗  ██╗  █████╗  ██╗  ██╗ ███████╗ ██████╗  ██████╗ ██╗   ██╗
 ██║    ██║ ██║  ██║ ██╔══██╗ ██║ ██╔╝ ██╔════╝ ██╔══██╗ ██╔══██╗╚██╗ ██╔╝
 ██║ █╗ ██║ ███████║ ███████║ █████╔╝  █████╗   ██████╔╝ ██████╔╝ ╚████╔╝
 ██║███╗██║ ██╔══██║ ██╔══██║ ██╔═██╗  ██╔══╝   ██╔══██╗ ██╔═══╝   ╚██╔╝
 ╚███╔███╔╝ ██║  ██║ ██║  ██║ ██║  ██╗ ███████╗ ██║  ██║ ██║        ██║
  ╚══╝╚══╝  ╚═╝  ╚═╝ ╚═╝  ╚═╝ ╚═╝  ╚═╝ ╚══════╝ ╚═╝  ╚═╝ ╚═╝        ╚═╝

   a Python library to create dynamic HTML content and web applications

              Copyright (C) 2023-2025 Brigitte Bigi, CNRS
         Laboratoire Parole et Langage, Aix-en-Provence, France

-----------------------------------------------------------------------------

"""

from .htmlmaker import *
from .httpd import *
from .messages import error
from .webapp import *

__version__ = "2.0"
___author__ = "Brigitte Bigi"
__copyright__ = "Copyright (C) 2023-2025 Brigitte Bigi, CNRS, Laboratoire Parole et Langage, Aix-en-Provence, France"
